### Import pandas

In [50]:
import pandas as pd
import numpy as np
import datetime
from os import listdir
from os.path import isfile, join
import glob
import re

### Read the .csv file and display data

In [51]:
df= pd.read_csv('/Users/jonathan/Documents/UntidySet1.csv')
df.head()

            Name   phonenumber date of birth   location      Job Degree
0    Stacy Adams      555-2219       7/23/98    florida      NaN     no
1  Walker, Alice    2129821112          1175         TX   lawyer      Y
2        Brandon  646-555-1236      12/18/93  Dallas,TX   Banker    yes
3   Robert Jones  212-999-6597       8/26/56         NC  retired      N

### Rename columns

In [52]:
df = df.rename(columns={'phonenumber': 'Phone number'})
df = df.rename(columns={'date of birth': 'Date of Birth'})
df = df.rename(columns={'location': 'Location'})
df.head()

            Name  Phone number Date of Birth   Location      Job Degree
0    Stacy Adams      555-2219       7/23/98    florida      NaN     no
1  Walker, Alice    2129821112          1175         TX   lawyer      Y
2        Brandon  646-555-1236      12/18/93  Dallas,TX   Banker    yes
3   Robert Jones  212-999-6597       8/26/56         NC  retired      N

In [53]:
new_df = pd.DataFrame(
    {
        "Name": ['Stacy Adams', 'Alice Walker', 'Brandon', 'Robert Jones'],
        "Phone Number": ['(000) 555-2219', '(212) 982-1112', '(646) 555-1236', '(212) 999-6597'],
        "Date of Birth": ['07/23/1998','01/01/1975', '12/18/1993' , '08/26/1956'],
        "Location": ['Florida', 'Texas', 'Texas', 'North Carolina'],
        "Job": ['N/A', 'Lawyer', 'Banker', 'Retired'],
        "Degree": ['No','Yes', 'Yes', 'No']
                         
}
)
new_df

           Name    Phone Number Date of Birth        Location      Job Degree
0   Stacy Adams  (000) 555-2219    07/23/1998         Florida      N/A     No
1  Alice Walker  (212) 982-1112    01/01/1975           Texas   Lawyer    Yes
2       Brandon  (646) 555-1236    12/18/1993           Texas   Banker    Yes
3  Robert Jones  (212) 999-6597    08/26/1956  North Carolina  Retired     No

### Create a new dataframe that is more organized. This data set was small, so it was easy to create a new data set manually

In [54]:
new_df = new_df[['Name', 'Date of Birth', 'Degree','Job', 'Location', 'Phone Number']]
new_df.head()

           Name Date of Birth Degree      Job        Location    Phone Number
0   Stacy Adams    07/23/1998     No      N/A         Florida  (000) 555-2219
1  Alice Walker    01/01/1975    Yes   Lawyer           Texas  (212) 982-1112
2       Brandon    12/18/1993    Yes   Banker           Texas  (646) 555-1236
3  Robert Jones    08/26/1956     No  Retired  North Carolina  (212) 999-6597

The original untidy data set provided by Chena Priant is now in a tidy data set. The columns have been rearranged in the priority I thought were important. The name is in the format of first name, last name. The date of birth is in the format of MM/DD/YYYY. Whether the person has a degree is either "No" or "Yes", the job description, location and phone number are neater.